<?php
/**
 * redis.php
 */

return [
    /*
    |--------------------------------------------------------------------------
    | Redis Connections
    |--------------------------------------------------------------------------
    |
    | 所有Redis连接资源
    | 默认值为: tcp://127.0.0.1:6379
    |
    */
    'connections' => [
        'default' => [
            'servers' => [
                'tcp://127.0.0.1:6379',
            ]
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Redis Scenes
    |--------------------------------------------------------------------------
    |
    | 定义了Redis使用场景, 这里定义了什么场景下使用哪个connection .
    | 必须指定场景才能使用场景.
    |
    */
    'scenes' => [
        'default' => [
            'connection' => 'default',
        ],
        'queue' => [
            'connection' => 'default',
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Redis script
    |--------------------------------------------------------------------------
    | 注册的scripts
    |
    */
    'scripts' => [
        'queueGet' => 'lib_redis_scripts_listQueueGetFirst',
    ],
];
